# SetEntity Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryPressureDropUIDataItem..::..SetEntity Method
DuctFittingAndAccessoryPressureDropUIDataItem Class See Also
---
Stores the entity in the UI data item.
**Namespace:** Autodesk.Revit.UI.Mechanical**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void SetEntity(
	Entity entity
)
```

Visual Basic
---
```text
Public Sub SetEntity ( _
	entity As Entity _
)
```

Visual C++
---
```text
public:
void SetEntity(
	Entity^ entity
)
```

# ### Parameters
entity
    Type: Autodesk.Revit.DB.ExtensibleStorage..::..Entity The Entity to be stored.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Writing of Entities of this Schema is not allowed to the current add-in. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DuctFittingAndAccessoryPressureDropUIDataItem Class
Autodesk.Revit.UI.Mechanical Namespace